app/controllers/pages_controller.rb

    def index
      @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."id" ASC LIMIT $1  [["LIMIT", 1]]